## EDA을 위한 다양한 pandas function 연습  
---
참고링크 : https://pandas.pydata.org/docs/user_guide/10min.html  
한글 : https://dandyrilla.github.io/2017-08-12/pandas-10min/

API ref : https://pandas.pydata.org/docs/reference/index.html

In [121]:
import numpy as np
import pandas as pd

### series and dataFrame 

차이점을 기억해 두자  
series 1차 배열  
dataFrame 2차 배열  

실제 data 특성에 맞는 샘플 데이터를 만들수 있어야 한다.   
해당 샘플 데이터로 각 연산 결과를 미리 확인 할 수 있어야 한다.   
print(type()) 을 이용하여 object 의 타입을 정확히 파악해야 한다.  
( series[index_label] vs dataframe[column_label] )  
answer.ipynb 와 test.ipynb, sample.ipynb 으로 운영한다.

In [122]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [123]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [124]:
df = pd.DataFrame(np.random.randn(6, 4),
                   index=dates, 
                   columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01  0.027218  0.134867  1.290976 -0.587499
2013-01-02  1.077611  0.406736  0.699013  0.638519
2013-01-03  0.369045  1.369056 -0.297095 -1.189735
2013-01-04 -1.109311  0.979234 -1.690049  0.369267
2013-01-05  0.283622  0.754991  2.050510 -0.092561
2013-01-06 -0.775822  0.029235  1.319602 -0.497490

dataFrame :   
DataFrame은 2차원 배열 데이터라고 이해하는 것보다 공통 인덱스를 가진 column series를 딕셔너리로 묶어놓은 것

In [125]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

df2 
# df2[:]
# df2[:][:]
# df2.loc[:,:]

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

### 2. Viewing Data

In [126]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [127]:
print(df.head(2),'\n')

print(df.tail(2), '\n')

print(df.index, '\n')

print(df.columns, '\n')

df.describe()

                   A         B         C         D
2013-01-01  0.027218  0.134867  1.290976 -0.587499
2013-01-02  1.077611  0.406736  0.699013  0.638519

                   A         B         C         D
2013-01-05  0.283622  0.754991  2.050510 -0.092561
2013-01-06 -0.775822  0.029235  1.319602 -0.497490

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

Index(['A', 'B', 'C', 'D'], dtype='object')

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.021273  0.612353  0.562159 -0.226583
std    0.801046  0.517271  1.352743  0.671225
min   -1.109311  0.029235 -1.690049 -1.189735
25%   -0.575062  0.202834 -0.048068 -0.564997
50%    0.155420  0.580864  0.994994 -0.295025
75%    0.347689  0.923173  1.312445  0.253810
max    1.077611  1.369056  2.050510  0.638519

In [128]:
# 행, 열을 바꾼다. 

df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.027218    1.077611    0.369045   -1.109311    0.283622   -0.775822
B    0.134867    0.406736    1.369056    0.979234    0.754991    0.029235
C    1.290976    0.699013   -0.297095   -1.690049    2.050510    1.319602
D   -0.587499    0.638519   -1.189735    0.369267   -0.092561   -0.497490

In [129]:
df.to_numpy()

array([[ 0.02721774,  0.13486666,  1.2909758 , -0.58749889],
       [ 1.07761086,  0.4067364 ,  0.69901284,  0.63851869],
       [ 0.36904506,  1.36905645, -0.29709464, -1.18973471],
       [-1.10931079,  0.97923417, -1.69004894,  0.36926705],
       [ 0.28362185,  0.75499073,  2.05050983, -0.09256076],
       [-0.77582223,  0.02923485,  1.31960181, -0.49748985]])

In [130]:
df.select_dtypes(include='int64')

Empty DataFrame
Columns: []
Index: [2013-01-01 00:00:00, 2013-01-02 00:00:00, 2013-01-03 00:00:00, 2013-01-04 00:00:00, 2013-01-05 00:00:00, 2013-01-06 00:00:00]

value_counts()

df.value_counts()   : 1 이상이면 동일한 row 존재  (전부 1이면, 다 값이 다르고, 실재 row 갯수 만큼 나온다.)  
series.value_counts() : 1 이상이면 동일한 값 존재

### 3. Selection 
```
.             : df.col
[]            : df[column]         , df[row_int: ]  
loc (or at)   : df.loc[index]      , df.loc[ : ,col]  
iloc (or iat) : df.iloc[index_int] , df.iloc[ : , col_int]  
```

In [131]:
print(df['A'],'\n')
print(df[:]['A'],'\n')              #df.loc[:,'A']
# df['2013-01-01':]['A']            # chained indexing ?
# df.A

## column 을 선택하게 되며 series 로 리턴된다.


print(df[['A']],'\n')               # df 으로 리턴 
df[['A','C']]                       # dataFrame 리턴

## 2개 이사, 이거나 [[ 'col' ]] 으로 1개 col 을 df 로 리터

2013-01-01    0.027218
2013-01-02    1.077611
2013-01-03    0.369045
2013-01-04   -1.109311
2013-01-05    0.283622
2013-01-06   -0.775822
Freq: D, Name: A, dtype: float64

2013-01-01    0.027218
2013-01-02    1.077611
2013-01-03    0.369045
2013-01-04   -1.109311
2013-01-05    0.283622
2013-01-06   -0.775822
Freq: D, Name: A, dtype: float64

                   A
2013-01-01  0.027218
2013-01-02  1.077611
2013-01-03  0.369045
2013-01-04 -1.109311
2013-01-05  0.283622
2013-01-06 -0.775822

                   A         C
2013-01-01  0.027218  1.290976
2013-01-02  1.077611  0.699013
2013-01-03  0.369045 -0.297095
2013-01-04 -1.109311 -1.690049
2013-01-05  0.283622  2.050510
2013-01-06 -0.775822  1.319602

In [132]:
# 오류 

# print(df[0],'\n')                # 명시적 인덱스 0 을 찾기때문에 오류
# print(df['2013-01-01'],'\n')     # column 에서 찾기 때문에 오류

In [133]:
# df[0:3]
# df['2013-01-01':'2013-01-03']
print(df['2013-01-04':], '\n')
print(df['2013-01-04':'2013-01-04'], '\n')     # 3, 4 열, label 은 끝 포함
print(df[3:4], '\n')                           # 3열만, index 은 -1 까지
df[3:]

# row 을 선택하게 되며, dataFrame 으로 리턴된다

                   A         B         C         D
2013-01-04 -1.109311  0.979234 -1.690049  0.369267
2013-01-05  0.283622  0.754991  2.050510 -0.092561
2013-01-06 -0.775822  0.029235  1.319602 -0.497490

                   A         B         C         D
2013-01-04 -1.109311  0.979234 -1.690049  0.369267

                   A         B         C         D
2013-01-04 -1.109311  0.979234 -1.690049  0.369267

                   A         B         C         D
2013-01-04 -1.109311  0.979234 -1.690049  0.369267
2013-01-05  0.283622  0.754991  2.050510 -0.092561
2013-01-06 -0.775822  0.029235  1.319602 -0.497490

In [134]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [135]:
#chained indexing?
print(df2[2:4]['A'],'\n')     # row / col
print(df2[2:4][0:4], '\n')     # row seriese 의 row serise
df2[2:4][0:1]                 # 2,3 row 로 만들어진 것에서 다시 0,1 row 첫번째

2    1.0
3    1.0
Name: A, dtype: float64

     A          B    C  D      E    F
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

     A          B    C  D     E    F
2  1.0 2013-01-02  1.0  3  test  foo

In [136]:
df2.iloc[0]     # 암묵적 인덱스 0 번째 선택

A                    1.0
B    2013-01-02 00:00:00
C                    1.0
D                      3
E                   test
F                    foo
Name: 0, dtype: object

In [137]:
df2.loc[2]        # 명시적 인덱스 2 선택

A                    1.0
B    2013-01-02 00:00:00
C                    1.0
D                      3
E                   test
F                    foo
Name: 2, dtype: object

Row

df.shape[0] = row 행갯수

In [138]:
df2.shape, df2.shape[0], df2.shape[1]

((4, 6), 4, 6)

In [139]:
# row label (명시적, 몇번) 을 이용해서 row 을 인덱싱
# index 가 int 인 경우 df.loc[index_int] 도 가능, 
print(df.loc['20130101'],'\n')              # series
print(df.loc['20130101':'20130102'],'\n')   # dataFrame
print(df.loc[['20130101','20130102']],'\n')

# row location (암묵적 , 몇번째) index 을 이용해서 row 인덱싱
print(df.iloc[0],'\n')                      # series
print(df.iloc[0:1],'\n')                    #dataFrame
print(df.iloc[[0,1]],'\n')

A    0.027218
B    0.134867
C    1.290976
D   -0.587499
Name: 2013-01-01 00:00:00, dtype: float64

                   A         B         C         D
2013-01-01  0.027218  0.134867  1.290976 -0.587499
2013-01-02  1.077611  0.406736  0.699013  0.638519

                   A         B         C         D
2013-01-01  0.027218  0.134867  1.290976 -0.587499
2013-01-02  1.077611  0.406736  0.699013  0.638519

A    0.027218
B    0.134867
C    1.290976
D   -0.587499
Name: 2013-01-01 00:00:00, dtype: float64

                   A         B         C         D
2013-01-01  0.027218  0.134867  1.290976 -0.587499

                   A         B         C         D
2013-01-01  0.027218  0.134867  1.290976 -0.587499
2013-01-02  1.077611  0.406736  0.699013  0.638519

Column

df.shape[1] = columns 열갯수

특정 column 은 몇번째 column 인가? 는 어떻게 찾지?

In [140]:

# column lable 을 이용해서 column 인덱싱
# print(df.loc['A'],'\n')      # 'A' 을 row 인텍싱으로 생각해서 
print(df.loc[:,'A'],'\n')
print(df.loc[:, ['A']],'\n')
print(df.loc[:,'A':'B'],'\n')
print(df.loc[:,['A','B']],'\n')

2013-01-01    0.027218
2013-01-02    1.077611
2013-01-03    0.369045
2013-01-04   -1.109311
2013-01-05    0.283622
2013-01-06   -0.775822
Freq: D, Name: A, dtype: float64

                   A
2013-01-01  0.027218
2013-01-02  1.077611
2013-01-03  0.369045
2013-01-04 -1.109311
2013-01-05  0.283622
2013-01-06 -0.775822

                   A         B
2013-01-01  0.027218  0.134867
2013-01-02  1.077611  0.406736
2013-01-03  0.369045  1.369056
2013-01-04 -1.109311  0.979234
2013-01-05  0.283622  0.754991
2013-01-06 -0.775822  0.029235

                   A         B
2013-01-01  0.027218  0.134867
2013-01-02  1.077611  0.406736
2013-01-03  0.369045  1.369056
2013-01-04 -1.109311  0.979234
2013-01-05  0.283622  0.754991
2013-01-06 -0.775822  0.029235

In [141]:
df.head()

                   A         B         C         D
2013-01-01  0.027218  0.134867  1.290976 -0.587499
2013-01-02  1.077611  0.406736  0.699013  0.638519
2013-01-03  0.369045  1.369056 -0.297095 -1.189735
2013-01-04 -1.109311  0.979234 -1.690049  0.369267
2013-01-05  0.283622  0.754991  2.050510 -0.092561

In [142]:

# column locatin (몇번째) index 을 이용해서 column 인덱싱
print(df.iloc[0],'\n')          # 0 을 row 인텍싱으로 생각해서 0번째 location row 을 인텍싱
print(df.iloc[:,0],'\n')        # 0 번째 column series 리턴
print(df.iloc[:,[0]])           # 0 번째 column df 리턴

A    0.027218
B    0.134867
C    1.290976
D   -0.587499
Name: 2013-01-01 00:00:00, dtype: float64

2013-01-01    0.027218
2013-01-02    1.077611
2013-01-03    0.369045
2013-01-04   -1.109311
2013-01-05    0.283622
2013-01-06   -0.775822
Freq: D, Name: A, dtype: float64

                   A
2013-01-01  0.027218
2013-01-02  1.077611
2013-01-03  0.369045
2013-01-04 -1.109311
2013-01-05  0.283622
2013-01-06 -0.775822

In [143]:
print(df.iloc[:,0:2],'\n')

                   A         B
2013-01-01  0.027218  0.134867
2013-01-02  1.077611  0.406736
2013-01-03  0.369045  1.369056
2013-01-04 -1.109311  0.979234
2013-01-05  0.283622  0.754991
2013-01-06 -0.775822  0.029235

In [144]:
print(df.iloc[:,[0,1,3]],'\n')

                   A         B         D
2013-01-01  0.027218  0.134867 -0.587499
2013-01-02  1.077611  0.406736  0.638519
2013-01-03  0.369045  1.369056 -1.189735
2013-01-04 -1.109311  0.979234  0.369267
2013-01-05  0.283622  0.754991 -0.092561
2013-01-06 -0.775822  0.029235 -0.497490

Multi-indxing

In [145]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [146]:
df2.loc[0:2,'A']

0    1.0
1    1.0
2    1.0
Name: A, dtype: float64

In [147]:
print(df2.loc[[0,1],['A','B']])    # 숫자가 lable 이다 df[[0,1]] 은 오류
print(df2.iloc[[0,1],[0,1]])

     A          B
0  1.0 2013-01-02
1  1.0 2013-01-02
     A          B
0  1.0 2013-01-02
1  1.0 2013-01-02

In [148]:
df

                   A         B         C         D
2013-01-01  0.027218  0.134867  1.290976 -0.587499
2013-01-02  1.077611  0.406736  0.699013  0.638519
2013-01-03  0.369045  1.369056 -0.297095 -1.189735
2013-01-04 -1.109311  0.979234 -1.690049  0.369267
2013-01-05  0.283622  0.754991  2.050510 -0.092561
2013-01-06 -0.775822  0.029235  1.319602 -0.497490

In [149]:
df[2:6][df[2:6].A < 0][1:2]

# df 의 2부터 6 row 중 A column  값이 0 보다 작은 두번재 row

                   A         B         C        D
2013-01-06 -0.775822  0.029235  1.319602 -0.49749

In [150]:
print(df[2:6])
print(df[2:6].A<0)

# 2개의 index가 같아야 한다. 
# IndexingError: Unalignable boolean Series provided as indexer (index of the boolean Series and of the indexed object do not match).

                   A         B         C         D
2013-01-03  0.369045  1.369056 -0.297095 -1.189735
2013-01-04 -1.109311  0.979234 -1.690049  0.369267
2013-01-05  0.283622  0.754991  2.050510 -0.092561
2013-01-06 -0.775822  0.029235  1.319602 -0.497490
2013-01-03    False
2013-01-04     True
2013-01-05    False
2013-01-06     True
Freq: D, Name: A, dtype: bool

Boolean indexing

```(df[])[(df[]) 조건][column]```  
```(df[]).loc[ (df[]) 조건 , column ]```

iloc 는 boolean index 을 사용할 수 없다.  
iLocation based boolean indexing on an integer type is not available

In [151]:
df[df['A']>0]['B']

2013-01-01    0.134867
2013-01-02    0.406736
2013-01-03    1.369056
2013-01-05    0.754991
Name: B, dtype: float64

In [152]:
df.loc[df['A']>0,'B']

2013-01-01    0.134867
2013-01-02    0.406736
2013-01-03    1.369056
2013-01-05    0.754991
Name: B, dtype: float64

In [153]:
df[1:3].A > 0

2013-01-02    True
2013-01-03    True
Freq: D, Name: A, dtype: bool

In [154]:
df[1:3][df[1:3].A > 0]

# df[df[1:3].A > 0]  은 오류가 난다.  df 의 index 와 df[1:3] 의 index 가 서로 맞지않다.

                   A         B         C         D
2013-01-02  1.077611  0.406736  0.699013  0.638519
2013-01-03  0.369045  1.369056 -0.297095 -1.189735

In [155]:
df[1:3][df[1:3].A > 0]['B']
# df1 = df[1:3]
# df1.A > 0
# df1['B']

2013-01-02    0.406736
2013-01-03    1.369056
Freq: D, Name: B, dtype: float64

funtion indexing

```
pipe()  : Tablewise Function Application
apply() : Row or Column-wise Function Application
agg() and transform() : Aggregation API
applymap() : Applying Elementwise Functions

cut()    : 조건에 따른 구간별 label
where()  : 조건에 따른 값표시 (아닌값은 NaN)
```

In [156]:
df

                   A         B         C         D
2013-01-01  0.027218  0.134867  1.290976 -0.587499
2013-01-02  1.077611  0.406736  0.699013  0.638519
2013-01-03  0.369045  1.369056 -0.297095 -1.189735
2013-01-04 -1.109311  0.979234 -1.690049  0.369267
2013-01-05  0.283622  0.754991  2.050510 -0.092561
2013-01-06 -0.775822  0.029235  1.319602 -0.497490

In [157]:
df3 = df.copy()
df3['sum_row'] = df3.apply(np.sum,axis=1)    # df3.sum(axis=1) 과 같다.
df3

                   A         B         C         D   sum_row
2013-01-01  0.027218  0.134867  1.290976 -0.587499  0.865561
2013-01-02  1.077611  0.406736  0.699013  0.638519  2.821879
2013-01-03  0.369045  1.369056 -0.297095 -1.189735  0.251272
2013-01-04 -1.109311  0.979234 -1.690049  0.369267 -1.450859
2013-01-05  0.283622  0.754991  2.050510 -0.092561  2.996562
2013-01-06 -0.775822  0.029235  1.319602 -0.497490  0.075525

In [158]:
df3["result"] = df3.apply(lambda r: "Over" if r.sum_row > 0 else "Under", axis=1)
df3

                   A         B         C         D   sum_row result
2013-01-01  0.027218  0.134867  1.290976 -0.587499  0.865561   Over
2013-01-02  1.077611  0.406736  0.699013  0.638519  2.821879   Over
2013-01-03  0.369045  1.369056 -0.297095 -1.189735  0.251272   Over
2013-01-04 -1.109311  0.979234 -1.690049  0.369267 -1.450859  Under
2013-01-05  0.283622  0.754991  2.050510 -0.092561  2.996562   Over
2013-01-06 -0.775822  0.029235  1.319602 -0.497490  0.075525   Over

In [159]:
# bins=[-100,0,100]
# labels =['under','over']      # bins 보다 하나 적은 갯수 (사이값) 이어야 한다.
pd.cut(df3.sum_row, bins=[-100,0,100], labels=['under','over'] )

2013-01-01     over
2013-01-02     over
2013-01-03     over
2013-01-04    under
2013-01-05     over
2013-01-06     over
Freq: D, Name: sum_row, dtype: category
Categories (2, object): ['under' < 'over']

In [160]:
df3 = df3.drop(columns='result')
df3

                   A         B         C         D   sum_row
2013-01-01  0.027218  0.134867  1.290976 -0.587499  0.865561
2013-01-02  1.077611  0.406736  0.699013  0.638519  2.821879
2013-01-03  0.369045  1.369056 -0.297095 -1.189735  0.251272
2013-01-04 -1.109311  0.979234 -1.690049  0.369267 -1.450859
2013-01-05  0.283622  0.754991  2.050510 -0.092561  2.996562
2013-01-06 -0.775822  0.029235  1.319602 -0.497490  0.075525

In [161]:
df3.where((df3.sum_row>0) & (df3.B>0))    # boolean 으로 리턴하지 않고, 값을 리턴 하다. dropna() 을 붙일수 있다.

                   A         B         C         D   sum_row
2013-01-01  0.027218  0.134867  1.290976 -0.587499  0.865561
2013-01-02  1.077611  0.406736  0.699013  0.638519  2.821879
2013-01-03  0.369045  1.369056 -0.297095 -1.189735  0.251272
2013-01-04       NaN       NaN       NaN       NaN       NaN
2013-01-05  0.283622  0.754991  2.050510 -0.092561  2.996562
2013-01-06 -0.775822  0.029235  1.319602 -0.497490  0.075525

In [162]:
df3[(df3.sum_row>0) & (df3.B>0)]

# dropna() 까지 한 결과

                   A         B         C         D   sum_row
2013-01-01  0.027218  0.134867  1.290976 -0.587499  0.865561
2013-01-02  1.077611  0.406736  0.699013  0.638519  2.821879
2013-01-03  0.369045  1.369056 -0.297095 -1.189735  0.251272
2013-01-05  0.283622  0.754991  2.050510 -0.092561  2.996562
2013-01-06 -0.775822  0.029235  1.319602 -0.497490  0.075525

### 4. Missing 

``` 
dropna()
fillna()
notnull()
notna()   
isnull()
isna() 
```

In [163]:
df3.where((df3.sum_row>0) & (df3.B>0)).fillna(0)

                   A         B         C         D   sum_row
2013-01-01  0.027218  0.134867  1.290976 -0.587499  0.865561
2013-01-02  1.077611  0.406736  0.699013  0.638519  2.821879
2013-01-03  0.369045  1.369056 -0.297095 -1.189735  0.251272
2013-01-04  0.000000  0.000000  0.000000  0.000000  0.000000
2013-01-05  0.283622  0.754991  2.050510 -0.092561  2.996562
2013-01-06 -0.775822  0.029235  1.319602 -0.497490  0.075525

### 5. Operations

```
sum, mean, std, var
sort, count
apply
str
```

In [164]:
print(df.sort_index())
print(df.sort_values('A'),'\n')
# df.sort_values(by='A')
print(df.sort_values(by= ['A','B'],ascending=False))

                   A         B         C         D
2013-01-01  0.027218  0.134867  1.290976 -0.587499
2013-01-02  1.077611  0.406736  0.699013  0.638519
2013-01-03  0.369045  1.369056 -0.297095 -1.189735
2013-01-04 -1.109311  0.979234 -1.690049  0.369267
2013-01-05  0.283622  0.754991  2.050510 -0.092561
2013-01-06 -0.775822  0.029235  1.319602 -0.497490
                   A         B         C         D
2013-01-04 -1.109311  0.979234 -1.690049  0.369267
2013-01-06 -0.775822  0.029235  1.319602 -0.497490
2013-01-01  0.027218  0.134867  1.290976 -0.587499
2013-01-05  0.283622  0.754991  2.050510 -0.092561
2013-01-03  0.369045  1.369056 -0.297095 -1.189735
2013-01-02  1.077611  0.406736  0.699013  0.638519

                   A         B         C         D
2013-01-02  1.077611  0.406736  0.699013  0.638519
2013-01-03  0.369045  1.369056 -0.297095 -1.189735
2013-01-05  0.283622  0.754991  2.050510 -0.092561
2013-01-01  0.027218  0.134867  1.290976 -0.587499
2013-01-06 -0.775822  0.029235  1.319602 -0.497490
2013-01-04 -1.109311  0.979234 -1.690049  0.369267

In [165]:
print(df.sum())          # row 들의 합 (col : 합) axis=0 디폴트
print(df.sum(axis=1))    # column 들의 함 (row : 합) axis=1

A   -0.127638
B    3.674119
C    3.372957
D   -1.359498
dtype: float64
2013-01-01    0.865561
2013-01-02    2.821879
2013-01-03    0.251272
2013-01-04   -1.450859
2013-01-05    2.996562
2013-01-06    0.075525
Freq: D, dtype: float64

### 6. Merging

```
concat
join
merge
```

### 7. Grouping

```
Splitting the data into groups based on some criteria
Applying a function to each group independently
Combining the results into a data structure

```

In [166]:
df_g = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)

df_g

     A      B         C         D
0  foo    one -0.823885  1.015084
1  bar    one  0.332875  0.218404
2  foo    two -1.470511  0.788665
3  bar  three  0.269852 -0.645446
4  foo    two  1.209252  1.527803
5  bar    two  0.881340 -0.202288
6  foo    one  0.162408  0.509323
7  foo  three  0.049036  1.638719

value_counts()

In [175]:
df_g.groupby(['A','B'])['C'].value_counts()

# df_g.groupby(['A','B'])['C'].value_counts().reset_index() 는 오류발생. ('C' 가 중복된다. )
# new_df_g = df_g.groupby(['A','B'])['C'].value_counts()
# new_df_g.name = C_count
# new_df_g.reset_index()

A    B      C
bar  one     0.332875    1
     three   0.269852    1
     two     0.881340    1
foo  one    -0.823885    1
             0.162408    1
     three   0.049036    1
     two    -1.470511    1
             1.209252    1
Name: C, dtype: int64

In [109]:
df_g.groupby(['A','B'])[['C']].sum().reset_index()

     A      B         C
0  bar    one  1.429825
1  bar  three  0.137487
2  bar    two -0.089975
3  foo    one -0.245829
4  foo  three -1.093053
5  foo    two  2.171548

### 8. Reshaping

```
reshpae(-1)
stack / unstack 
pivot table
```

In [48]:
df_g.set_index(['A','B'])[['C']]#.unstack()

# Index contains duplicate entries, cannot reshape : 'foo one' 이 중복된다. 
# df.drop_duplicates(subset=['index','column']) 으로 해결

                  C
A   B
foo one    0.091632
bar one   -0.821188
foo two   -0.142519
bar three -2.197673
foo two    1.761740
bar two    0.456469
foo one   -0.480759
    three  1.980207

drop_duplic

subset : 중복을 검사할 column 
keep: 중복값중 남길 행

df.drop ()
axis = 0/1 (행/열)     조건이 있는 경우 slicing 을 이용하자

In [49]:
# df_g2 = df_g.drop([6,2]).reset_index(drop=True) 
# A,B 열 값이 중복되는 2, 6 row을 삭제

df_g2 = df_g.drop_duplicates(subset=['A','B'],keep='first', ignore_index=True).copy()  # inplace = True 으로 원본 적용

df_g2

     A      B         C         D
0  foo    one  0.091632  0.294660
1  bar    one -0.821188  0.711229
2  foo    two -0.142519  0.714619
3  bar  three -2.197673  2.046995
4  bar    two  0.456469  1.471471
5  foo  three  1.980207  0.255492

In [52]:
df_g2.set_index(['A','B'])[['C']].unstack()

            C
B         one     three       two
A
bar -0.821188 -2.197673  0.456469
foo  0.091632  1.980207 -0.142519

In [344]:
df_g2.pivot(index='A',columns='B',values='C')

B         one     three       two
A
bar -0.955413 -0.767378  1.233851
foo  0.020773 -1.128363 -0.070888

### 9. Time Series

### 10. Categroicals

### 11. Plotting